org/RforS-II-common.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-10-18 月 10:33 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>RforS あれこれ (データ解析)</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="suzuki@iwate-u.ac.jp 鈴木正幸，非常勤講師" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://wiki.cis.iwate-u.ac.jp/~suzuki/org-html-theme/styles/bigblow/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/hideshow.css"/>
</head>
<body>
<div id="content">
<h1 class="title">RforS あれこれ (データ解析)</h1>
<div id="outline-container-orge71bf34" class="outline-2">
<h2 id="orge71bf34">関連サイト</h2>
<div class="outline-text-2" id="text-orge71bf34">
<p>
<a href="http://www.cc.aoyama.ac.jp/~t41338/lecture/aoyama/stat2e/stat2e_top.html">社会統計演習</a> (青山)
</p>
<ul class="org-ul">
<li>RforSの動画解説</li>
</ul>

<p>
<a href="http://whitewell.sakura.ne.jp/R/">Webpage for Probability Theory and Statistics (B)</a>
</p>
<ul class="org-ul">
<li>Rの基礎</li>
<li>確率</li>
<li>RforS の解説</li>
</ul>

<p>
<a href="https://repun-app.fish.hokudai.ac.jp/course/view.php?id=395#section-3">コース: 統計解析入門 &amp; 統計解析フリーソフトウェアRの使い方</a>     
</p>
</div>
</div>

<div id="outline-container-orgf8261a2" class="outline-2">
<h2 id="orgf8261a2">Rの説明</h2>
<div class="outline-text-2" id="text-orgf8261a2">
</div>
<div id="outline-container-orgea65e5e" class="outline-3">
<h3 id="orgea65e5e">Biostat R入門</h3>
<div class="outline-text-3" id="text-orgea65e5e">
<ul class="org-ul">
<li><a href="http://chianti.ucsd.edu/~rsaito/ENTRY1/WEB_RS3/PDF/JPN/Texts/R_Stats2.pdf">初心者用 - R_Stats2.pdf</a></li>

<li><a href="https://so-zou.jp/robot/tech/numerical-analysis/r/">R プログラミング解説</a></li>
</ul>
</div>
</div>

<div id="outline-container-org947f832" class="outline-3">
<h3 id="org947f832">その他</h3>
<div class="outline-text-3" id="text-org947f832">
<p>
<a href="http://cse.naro.affrc.go.jp/takezawa/r-tips/r/59.html">R-Source</a> (基本統計量)
</p>

<p>
<a href="http://www.mi.u-tokyo.ac.jp/teaching_material.html">数理・データサイエンス関連教材 | 東京大学 数理・情報教育研究センター</a>
</p>
<ul class="org-ul">
<li>Rstudio による R入門， 動画</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org2f1c069" class="outline-2">
<h2 id="org2f1c069">graphics</h2>
<div class="outline-text-2" id="text-org2f1c069">
<p>
<a href="http://www.f.waseda.jp/sakas/R/Rgraphics17.html">R:グラフィックス</a> 早稲田のよくまとまった説明
</p>

<p>
<a href="https://data-science.gr.jp/implementation/ida_r_barplot.html">Rによる棒グラフの描画</a> <a href="https://data-science.gr.jp/implementation.html#ida">データ科学便覧 実装関連事項</a> データ科学便覧
</p>

<p>
<a href="https://www.kobiwa.jp/2017/02/18/post-240/">[R]グラフの一部を塗りつぶす</a> ** <a href="file:///nas/home/masayuki/COMM/Lects/R/RforStatistcs/RforS/org/graphics.html#MissingReference">正規分布グラフの区間を塗り潰す</a> (R)
</p>
</div>
</div>

<div id="outline-container-org8063924" class="outline-2">
<h2 id="org8063924">Rの環境</h2>
<div class="outline-text-2" id="text-org8063924">
<div class="org-src-container">
<pre class="src src-R">
<span style="color: #99968b;">## </span><span style="color: #99968b;">system("dir")</span>
<span style="color: #99968b;">## </span><span style="color: #99968b;">system("mkdir graphs")</span>

objects() <span style="color: #99968b;">#</span>
ls()

</pre>
</div>

<pre class="example">
[1] "科目"   "好意度" "人"
[1] "科目"   "好意度" "人"
</pre>
</div>
</div>


<div id="outline-container-org00427a5" class="outline-2">
<h2 id="org00427a5">データフレームの扱い</h2>
<div class="outline-text-2" id="text-org00427a5">
<p>
<a href="file:///nas/home/masayuki/COMM/Lects/R/Rintro/Rintro-3.html">file:~/COMM/Lects/R/Rintro/Rintro-3.org</a>
RforS-package.org
RforS-data.org
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: suzuki@iwate-u.ac.jp 鈴木正幸，非常勤講師</p>
<p class="date">Created: 2021-10-18 月 10:33</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
